# Basic example

In [19]:
import numpy as np

In [20]:
import pandas as pd  
  

data = {'color': ['red', 'blue', 'green', 'red', 'blue']}  

df = pd.DataFrame(data)

In [21]:
data

{'color': ['red', 'blue', 'green', 'red', 'blue']}

In [22]:
df

   color
0    red
1   blue
2  green
3    red
4   blue

In [23]:
df.head()

   color
0    red
1   blue
2  green
3    red
4   blue

### This below 3 are the example of class 8

### Below 3 methods are used when data have single column

In [24]:
c =np.unique(df,return_counts = True)     # count the unique values
c

(array(['blue', 'green', 'red'], dtype=object), array([2, 1, 2], dtype=int64))

In [25]:
l = len(np.unique(df))                # len of the unique values
l

3

In [26]:
a = np.unique(df)          # Display Unique values
a

array(['blue', 'green', 'red'], dtype=object)

###  This 2 are new   - ' value_counts() , unique()  '

## Value_counts()

In [27]:
df["color"].value_counts()    # This is used to cont the seperate values

color
red      2
blue     2
green    1
Name: count, dtype: int64

##  unique

In [28]:
df["color"].unique()         # this type unique is uesd to find the seperate index unique

array(['red', 'blue', 'green'], dtype=object)

# categorical Data

In [29]:
df1=pd.read_excel("D:\\anacoda\\ML DATA NOTES\\CHAVALI.xlsx")
df1

      name cast  age sex   Dob
0    kumar   bc   19   M  2002
1  krishna   oc   20   M  1998
2      sai   sc   22   F  2001
3    pavan   oc   20   M  2003
4   vishnu   bc   21   F  2000
5  sudheer   st   24   M  2003
6    akhil   bc   23   M  2002
7     hari   st   20   F  1999
8    vijay   oc   22   M  2001
9     ajay   sc   21   F  2004

In [30]:
df1.dtypes          # we need to convert object to int

name    object
cast    object
age      int64
sex     object
Dob      int64
dtype: object

###  Below 2 are same

In [31]:
c1 =np.unique(df1['sex'],return_counts = True)   # correct  
c1 

# c1 =np.unique(df1,return_counts = True)     # wrong
# c1

(array(['F', 'M'], dtype=object), array([4, 6], dtype=int64))

In [32]:
df1['sex'].value_counts()

sex
M    6
F    4
Name: count, dtype: int64

### Below 2 are same

In [33]:
a1=np.unique(df1['sex'])     # correct 
a1

# a1=np.unique(df1)     # wrong 
# a1

array(['F', 'M'], dtype=object)

In [34]:
df1['sex'].unique()

array(['M', 'F'], dtype=object)

### THis is used to find length

In [35]:
l1 = len(np.unique(df1['sex']))   # correct
l1


#l1 = len(np.unique(df1))    # wrong    
# l1

2

# LabelEncoder

### The label encoder is used to convert the alphabetical data into numerical form

### * Because system understood only numerical form

In [36]:
from sklearn.preprocessing import LabelEncoder

In [37]:
df1['name'].unique()

array(['kumar', 'krishna', 'sai', 'pavan', 'vishnu', 'sudheer', 'akhil',
       'hari', 'vijay', 'ajay'], dtype=object)

In [38]:
label_encoder = LabelEncoder()

In [39]:
df1.dtypes          # we need covert objects into numerical form

name    object
cast    object
age      int64
sex     object
Dob      int64
dtype: object

In [40]:
df1['name'] = label_encoder.fit_transform(df1['name'])
df1['name']

0    4
1    3
2    6
3    5
4    9
5    7
6    1
7    2
8    8
9    0
Name: name, dtype: int32

In [41]:
df1['sex'] = label_encoder.fit_transform(df1['sex'])
df1["sex"]

0    1
1    1
2    0
3    1
4    0
5    1
6    1
7    0
8    1
9    0
Name: sex, dtype: int32

In [42]:
df1['cast'] = label_encoder.fit_transform(df1['cast'])
df1['cast']

0    0
1    1
2    2
3    1
4    0
5    3
6    0
7    3
8    1
9    2
Name: cast, dtype: int32

In [43]:
df1

   name  cast  age  sex   Dob
0     4     0   19    1  2002
1     3     1   20    1  1998
2     6     2   22    0  2001
3     5     1   20    1  2003
4     9     0   21    0  2000
5     7     3   24    1  2003
6     1     0   23    1  2002
7     2     3   20    0  1999
8     8     1   22    1  2001
9     0     2   21    0  2004

In [44]:
df1.dtypes

name    int32
cast    int32
age     int64
sex     int32
Dob     int64
dtype: object

# one hot encoding

In [45]:
from sklearn.preprocessing import OneHotEncoder     # no need
import pandas as pd
import numpy as np

In [47]:
df2 =pd.read_excel("D:\\anacoda\\ML DATA NOTES\\CHAVALI.xlsx")
df2

      name cast  age sex   Dob
0    kumar   bc   19   M  2002
1  krishna   oc   20   M  1998
2      sai   sc   22   F  2001
3    pavan   oc   20   M  2003
4   vishnu   bc   21   F  2000
5  sudheer   st   24   M  2003
6    akhil   bc   23   M  2002
7     hari   st   20   F  1999
8    vijay   oc   22   M  2001
9     ajay   sc   21   F  2004

In [48]:
# one_hot_encoder = OneHotEncoder           # no need

In [49]:
pd.get_dummies(df2)   # True = 1  , False = 0

,age,Dob,name_ajay,name_akhil,name_hari,name_krishna,name_kumar,name_pavan,name_sai,name_sudheer,name_vijay,name_vishnu,cast_bc,cast_oc,cast_sc,cast_st,sex_F,sex_M
0,19,2002,False,False,False,False,True,False,False,False,False,False,True,False,False,False,False,True
1,20,1998,False,False,False,True,False,False,False,False,False,False,False,True,False,False,False,True
2,22,2001,False,False,False,False,False,False,True,False,False,False,False,False,True,False,True,False
3,20,2003,False,False,False,False,False,True,False,False,False,False,False,True,False,False,False,True
4,21,2000,False,False,False,False,False,False,False,False,False,True,True,False,False,False,True,False
5,24,2003,False,False,False,False,False,False,False,True,False,False,False,False,False,True,False,True
6,23,2002,False,True,False,False,False,False,False,False,False,False,True,False,False,False,False,True
7,20,1999,False,False,True,False,False,False,False,False,False,False,False,False,False,True,True,False
8,22,2001,False,False,False,False,False,False,False,False,True,False,False,True,False,False,False,True
9,21,2004,True,False,False,False,False,False,False,False,False,False,False,False,True,False,True,False

In [50]:
one_hot_encoder1 = pd.get_dummies(df2['sex'])
df2

      name cast  age sex   Dob
0    kumar   bc   19   M  2002
1  krishna   oc   20   M  1998
2      sai   sc   22   F  2001
3    pavan   oc   20   M  2003
4   vishnu   bc   21   F  2000
5  sudheer   st   24   M  2003
6    akhil   bc   23   M  2002
7     hari   st   20   F  1999
8    vijay   oc   22   M  2001
9     ajay   sc   21   F  2004

In [51]:
one_hot_encoder1

       F      M
0  False   True
1  False   True
2   True  False
3  False   True
4   True  False
5  False   True
6  False   True
7   True  False
8  False   True
9   True  False